In [ ]:
#Pandas is a powerful data manipulation library built on top of NumPy. It provides to main data structure : Series(1d) and dataframe(2d which are designed for handling structured data with labeled axes

In [ ]:
import pandas as pd
import numpy as np

In [2]:
#Creating Series
age =[10,20,30,40,50]
s1 = pd.Series(age, index=['a','b','c','d','e'])
print(s1)

NameError: name 'pd' is not defined

In [7]:
#Creating a dataframe from dictionary
import pandas as pd
data = {
    'Name':['Alice','Bob','Charlie','David'],
    'Age':[24,27,22,32],
    'City':['New York','Los Angeles','Chicago','Houston']

}
# print(data)
# type(data)
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [ ]:
# !pip3 install pandas

Requirement already satisfied: pandas in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\rashm\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [ ]:
print("Dataframe")
print(df.info)

print("")
print()

In [2]:
import pandas as pd
students = {
    'Name':['Emma','Liam','Olivia','Noah'],
    'Age':[21,23,22,24],
    'Major':['Biology','Computer Science','Mathematics','Physics']
}
df = pd.DataFrame(students)
print(df)

     Name  Age             Major
0    Emma   21           Biology
1    Liam   23  Computer Science
2  Olivia   22       Mathematics
3    Noah   24           Physics

In [3]:
print("Data Frame Info")
print(df.info())

Data Frame Info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Major   4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes
None

In [4]:
print("Basic Statistics of data")
print(df.describe())

Basic Statistics of data
             Age
count   4.000000
mean   22.500000
std     1.290994
min    21.000000
25%    21.750000
50%    22.500000
75%    23.250000
max    24.000000

In [5]:
df.head()

     Name  Age             Major
0    Emma   21           Biology
1    Liam   23  Computer Science
2  Olivia   22       Mathematics
3    Noah   24           Physics

In [6]:
df.tail

<bound method NDFrame.tail of      Name  Age             Major
0    Emma   21           Biology
1    Liam   23  Computer Science
2  Olivia   22       Mathematics
3    Noah   24           Physics>

In [7]:
df[['Name']]

     Name
0    Emma
1    Liam
2  Olivia
3    Noah

In [ ]:
#Feature Engineering -Creating a new column 'Total' which is sum in

In [8]:
import pandas as pd
employees = pd.DataFrame(
    {
        'Name': ['John', 'Anna', 'Peter', 'Linda', 'James', 'Susan', 'Robert', 'Jessica', 'Michael', 'Sarah'],
        'Age': [28, 34, 29, 42, 36, 31, 45, 27, 39, 33],
        'Department': ['HR', 'Finance', 'IT', 'Marketing', 'Sales', 'IT', 'Finance', 'HR', 'Marketing', 'Sales'],
        'Salary': [50000, 60000, 75000, 65000, 70000, 72000, 68000, 59000, 64000, 71000],
        'Experience_Years': [5, 7, 10, 6, 8, 9, 7, 4, 6, 8]
    }
)


employees

      Name  Age Department  Salary  Experience_Years
0     John   28         HR   50000                 5
1     Anna   34    Finance   60000                 7
2    Peter   29         IT   75000                10
3    Linda   42  Marketing   65000                 6
4    James   36      Sales   70000                 8
5    Susan   31         IT   72000                 9
6   Robert   45    Finance   68000                 7
7  Jessica   27         HR   59000                 4
8  Michael   39  Marketing   64000                 6
9    Sarah   33      Sales   71000                 8

In [9]:
#loc-label based indexing
employees.loc[0:2]

    Name  Age Department  Salary  Experience_Years
0   John   28         HR   50000                 5
1   Anna   34    Finance   60000                 7
2  Peter   29         IT   75000                10

In [10]:
#loc-label based indexing
#employees.loc[2:5,['Name':'Department']]
employees.loc[2:5, 'Name':'Department']

    Name  Age Department
2  Peter   29         IT
3  Linda   42  Marketing
4  James   36      Sales
5  Susan   31         IT

In [11]:
employees.iloc[2:7]

     Name  Age Department  Salary  Experience_Years
2   Peter   29         IT   75000                10
3   Linda   42  Marketing   65000                 6
4   James   36      Sales   70000                 8
5   Susan   31         IT   72000                 9
6  Robert   45    Finance   68000                 7

In [ ]:
#iloc-based Indexing
employees.iloc[0:3,0:2] #first 3 rows and first 2 columns

    Name  Age
0   John   28
1   Anna   34
2  Peter   29

In [14]:
#Boolean Indexing
#Employees in the It department
condition = (employees['Department'] == 'IT')
print(employees[condition])
print(condition)

    Name  Age Department  Salary  Experience_Years
2  Peter   29         IT   75000                10
5  Susan   31         IT   72000                 9
0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: Department, dtype: bool

In [15]:
#Multiple Conditions
#Employees in IT department whose age is below 30
condition2 =(employees['Department']=='IT')&(employees['Age']<30)
print(employees[condition2])
print(condition2)

    Name  Age Department  Salary  Experience_Years
2  Peter   29         IT   75000                10
0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [17]:
employees[(employees['Salary']>70000) & (employees['Experience_Years']>9)]

    Name  Age Department  Salary  Experience_Years
2  Peter   29         IT   75000                10

In [19]:
condition4 = (employees['Age']>40) | (employees['Experience_Years']>=9)
print(condition4)
top_emp= employees[condition4].copy()
top_emp

0    False
1    False
2     True
3     True
4    False
5     True
6     True
7    False
8    False
9    False
dtype: bool

     Name  Age Department  Salary  Experience_Years
2   Peter   29         IT   75000                10
3   Linda   42  Marketing   65000                 6
5   Susan   31         IT   72000                 9
6  Robert   45    Finance   68000                 7

In [20]:
employees.query('Salary > 70000 and Experience_Years < 9')

    Name  Age Department  Salary  Experience_Years
9  Sarah   33      Sales   71000                 8